Description: Downloads the latest version of Zoom (64-bit) for Ubuntu
Identifier: com.github.SsShigZzZ.download.Zoom-deb
MinimumVersion: '1.0.0'

Process:
- Processor: URLDownloader
  Arguments:
    url: 'https://zoom.us/client/latest/zoom_amd64.deb'
    prefetch_filename: true

