Description: Downloads the latest version of Zoom (64-bit) for Windows
Identifier: com.github.SsShigZzZ.download.Zoom-deb
MinimumVersion: '1.0.0'

Process:
- Processor: URLDownloader
  Arguments:
    url: 'https://zoom.us/client/latest/zoom_amd64.deb'
    prefetch_filename: true
    request_headers:
      user-agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2227.1 Safari/537.36
    CHECK_FILESIZE_ONLY: true

